Model: "sequential_1"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_1 (Conv2D)            (None, 22, 85, 24)        240       
_________________________________________________________________
batch_normalization_1 (Batch (None, 22, 85, 24)        96        
_________________________________________________________________
max_pooling2d_1 (MaxPooling2 (None, 11, 42, 24)        0         
_________________________________________________________________
activation_1 (Activation)    (None, 11, 42, 24)        0         
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 9, 40, 48)         10416     
_________________________________________________________________
max_pooling2d_2 (MaxPooling2 (None, 4, 20, 48)         0         
_________________________________________________________________
activation_2 (Activation)    (None, 4, 20, 48)         0         
_________________________________________________________________
conv2d_3 (Conv2D)            (None, 2, 18, 48)         20784     
_________________________________________________________________
activation_3 (Activation)    (None, 2, 18, 48)         0         
_________________________________________________________________
flatten_1 (Flatten)          (None, 1728)              0         
_________________________________________________________________
dropout_1 (Dropout)          (None, 1728)              0         
_________________________________________________________________
dense_1 (Dense)              (None, 128)               221312    
_________________________________________________________________
activation_4 (Activation)    (None, 128)               0         
_________________________________________________________________
dropout_2 (Dropout)          (None, 128)               0         
_________________________________________________________________
dense_2 (Dense)              (None, 25)                3225      
_________________________________________________________________
activation_5 (Activation)    (None, 25)                0         
=================================================================
Total params: 256,073
Trainable params: 256,025
Non-trainable params: 48
_________________________________________________________________